window.__CAMP_CLASS = {
    "阵营羁绊":["夜之半神","贝洛伯格","银河学者","公司","盛会之星","星间旅人","狼狩","巡海游侠","列车同行","昼之半神","星核猎手","仙舟"],
    "流派羁绊":["战技点","能量","治疗","欢愉","群攻","持续伤害","燃血","护盾","追击","击破","量子同频","减益"],
    "独立羁绊":["头号玩家","大守护者","命运卜者","挚爱之人","魔术师","救世主"]
  };

window.__CAMP_MEM = {
  "群攻": ["黑塔","翡翠","银枝","缇宝","那刻夏","大黑塔","景元"],
  "持续伤害": ["艾丝妲","桑博","卡芙卡","海瑟音","黑天鹅"],
  "燃血": ["刃","万敌","风堇","镜流","长夜月","遐蝶","布洛妮娅"],
  "护盾": ["三月七","丹恒腾荒","砂金","杰帕德"],
  "追击": ["貊泽","赛飞儿","飞霄","不死途","砂金","真理医生","知更鸟","托帕"],
  "击破": ["加拉赫","乱破","大丽花","阮梅","灵砂","忘归人","姬子","波提欧","流萤"],
  "量子同频": ["花火","缇宝","希儿","符玄","银狼"],
  "减益": ["椒丘","赛飞儿","佩拉","黄泉","彦卿","瓦尔特"],
  "战技点": ["爻光","青雀","丹恒饮月","花火","刻律德菈","火花","Archer"],
  "能量": ["藿藿","停云","阿格莱雅","银枝","Saber","星期日","开拓者·记忆","云璃"],
  "治疗": ["椒丘","加拉赫","藿藿","娜塔莎","罗刹","符玄"],
  "欢愉": ["爻光","绯英","火花","银狼Lv.999","开拓者·欢愉","火花"],
  "头号玩家": ["银狼Lv.999"],
  "大守护者": ["布洛妮娅"],
  "命运卜者": ["黑天鹅"],
  "挚爱之人": ["昔涟"],
  "魔术师": ["Archer"],
  "救世主": ["白厄"],
  "公司": ["翡翠","砂金","托帕"],
  "盛会之星": ["加拉赫","大丽花","花火","星期日","知更鸟","黑天鹅"],
  "星间旅人": ["桑博","银枝","绯英","Saber","真理医生","火花","罗刹","Archer"],
  "狼狩": ["椒丘","貊泽","飞霄","灵砂","镜流","彦卿","云璃"],
  "巡海游侠": ["乱破","不死途","黄泉","波提欧"],
  "列车同行": ["三月七","丹恒饮月","姬子","星期日","开拓者·记忆","开拓者·欢愉","瓦尔特"],
  "昼之半神": ["阿格莱雅","缇宝","风堇","那刻夏","海瑟音","昔涟"],
  "夜之半神": ["赛飞儿","丹恒腾荒","万敌","刻律德菈","遐蝶","长夜月","昔涟"],
  "星核猎手": ["刃","卡芙卡","银狼","银狼Lv.999","流萤"],
  "仙舟": ["藿藿","青雀","停云","爻光","丹恒饮月","忘归人","符玄","彦卿","景元"],
  "贝洛伯格": ["桑博","佩拉","希儿","娜塔莎","杰帕德","布洛妮娅"],
  "银河学者": ["艾丝妲","黑塔","阮梅","真理医生","大黑塔"]
};

window.__CAMP_NUM = {
  "群攻": [3,5,7,9],
  "持续伤害": [2,4,6],
  "燃血": [2,4,6,8],
  "护盾": [2,4],
  "追击": [3,5,7,9],
  "击破": [2,4,6,8,10],
  "量子同频": [2,3,4,5],
  "减益": [2,4,6,8],
  "战技点": [2,4,6,8],
  "能量": [3,5,7,10],
  "治疗": [2,4,6],
  "欢愉": [3,4,5,7],
  "头号玩家": [1],
  "大守护者": [1],
  "命运卜者": [1],
  "挚爱之人": [1],
  "魔术师": [1],
  "救世主": [1],
  "公司": [2,3],
  "盛会之星": [2,3,4,5,6],
  "星间旅人": [1,2,3,4,5,6,7],
  "狼狩": [3,5,6,8],
  "巡海游侠": [1,2,3,4],
  "列车同行": [2,4,6],
  "昼之半神": [3,4,6,9],
  "夜之半神": [2,4,7,9],
  "星核猎手": [2,3,4],
  "仙舟": [3,5,7,10],
  "贝洛伯格": [2,4,6],
  "银河学者": [2,4,6]
};

window.__CAMP_COLORS = {
  "群攻": ["铜","银","金","幻彩"],
  "持续伤害": ["铜","银","金"],
  "燃血": ["铜","银","金","金"],
  "护盾": ["铜","银"],
  "追击": ["铜","银","金","幻彩"],
  "击破": ["铜","银","金","金","幻彩"],
  "量子同频": ["铜","银","金","金"],
  "减益": ["铜","银","金","幻彩"],
  "战技点": ["铜","银","金","幻彩"],
  "能量": ["铜","银","金","幻彩"],
  "治疗": ["铜","银","金"],
  "欢愉": ["铜","银","金","幻彩"],
  "头号玩家": ["金"],
  "大守护者": ["金"],
  "命运卜者": ["金"],
  "挚爱之人": ["金"],
  "魔术师": ["金"],
  "救世主": ["金"],
  "公司": ["铜","金"],
  "盛会之星": ["铜","银","银","金","金"],
  "星间旅人": ["铜","铜","银","银","金","金","金"],
  "狼狩": ["铜","银","金","幻彩"],
  "巡海游侠": ["铜","铜","金","金"],
  "列车同行": ["铜","银","金"],
  "昼之半神": ["铜","银","金","幻彩"],
  "夜之半神": ["铜","银","金","幻彩"],
  "星核猎手": ["铜","银","金"],
  "仙舟": ["铜","银","金","幻彩"],
  "贝洛伯格": ["铜","银","金"],
  "银河学者": ["铜","银","金"]
}

window.__CAMP_STATS = {
  "群攻":{
    "介绍":"【群攻】队员的幸运一击率提高，幸运一击伤害提高。进入战斗后在敌方场上生成2个可转移伤害的【借力球】。",
    3:"12%幸运一击率，12%幸运一击伤害。将受到伤害的40%转移给其他敌方目标。",
    5:"24%幸运一击率，24%幸运一击伤害。将受到伤害的60%转移给其他敌方目标。累计受到6次攻击后，发射激光造成8次250%基础伤害的量子属性伤害，单次攻击内最多累计1次。",
    7:"36%幸运一击率，36%幸运一击伤害。将受到伤害的100%转移给其他敌方目标，并使首领敌人受到的伤害提高30%。累计受到6次攻击后，发射激光造成8次500%基础伤害的量子属性伤害，单次攻击内最多累计1次。",
    9:"60%幸运一击率，60%幸运一击伤害。将受到伤害的100%转移给其他敌方目标，并使首领敌人受到的伤害提高100%。累计受到6次攻击后，发射激光造成12次1,500%基础伤害的量子属性伤害，单次攻击内最多累计1次。",
    "补充":"【借力球】：受到攻击后，使攻击者对其他敌方目标造成真实伤害，数值等同于自身本次攻击内所受伤害的一定比例。【借力球】免疫控制类负面状态。"
  },
  "持续伤害": {
    "介绍":"【持续伤害】队员的持续伤害增幅提高。敌方目标行动时，触发【超激发】，造成持续伤害并触发随机敌方目标的持续伤害效果。",
    2:"20%持续伤害增幅。【超激发】触发2次。",
    4:"60%持续伤害增幅。[超激发】触发3次。基础伤害倍率提高至480%。非首领敌方目标被消灭时，额外触发【超激发】。",
    6:"120%持续伤害增幅。【超激发】触发4次。基础伤害倍率提高至960%。",
    "补充":"【超激发】：对随机敌方目标造成240%基础伤害的持续伤害，并使其陷入的持续伤害状态立即产生相当于原伤害100%的伤害。"
  },
  "燃血": {
    "介绍":"【燃血】队员的生命增幅和伤害增幅提高。战斗开始时，激活会记录【燃血】队员消耗生命值并在行动时攻击敌方全体目标的【燃血角斗场】。\n【燃血】队员无法获得护盾，受到护盾时会回复2%生命增幅+1,000生命值。",
    2:"10%生命增幅，10%伤害增幅。可记录40,000点。",
    4:"20%生命增幅，25%伤害增幅。可记录100,000点，伤害倍率提高为1,000%。",
    6:"30%生命增幅，40%伤害增幅。可记录240,000点，伤害倍率提高为2,000%，行动后返还消耗量的30%",
    8:"45%生命增幅，60%伤害增幅。可记录720,000点，伤害倍率提高为4,000%，行动后返还消耗量的50%。",
    "补充":"【燃血角斗场】：记录【燃血】队员已损失的生命值，每10000点额外为【燃血】队员提供3%伤害增幅。并以300速度行动，行动时消耗所有记录值对敌方全体造成总量500%/1,000%/2,000%/4,000%+100%/200%/300%/400%基础伤害的物理属性伤害。"
  },
  "护盾": {
    "介绍":"【护盾】队员的护盾强度提高。我方小队获得伤害增幅。我方前台获得特殊护盾，获得其他护盾时该护盾会增加等量的护盾量，上限随阶段而提高。",
    2:"20%护盾强度，12%伤害增幅。我方小队持有的护盾可叠加，上限100%基础生命。",
    4:"40%护盾强度，40%伤害增幅。我方小队持有的护盾可叠加，上限100%基础生命。"
  },
  "追击": {
    "介绍":"【追击】队员追加攻击伤害增幅提高，攻击后附加1次等同于攻击者150%攻击力的随机属性附加伤害，该伤害视为追加攻击伤害。\n我方小队连续行动会提高【追击】队员的追加攻击伤害增幅，持续至任意敌方目标回合开始。",
    3:"20%追加攻击伤害增幅。连续行动提供5%追加攻击伤害增幅，最多20%。",
    5:"50%追加攻击伤害增幅。连续行动提供10%追加攻击伤害增幅，最多40%。连续行动达到5次后：可发动【总攻击】，造成60%的真实伤害。",
    7:"80%追加攻击伤害增幅。连续行动提供15%追加攻击伤害增幅，最多60%。【总攻击】造成120%的真实伤害。",
    9:"120%追加攻击伤害增幅。连续行动提供30%追加攻击伤害增幅，最多120%。【总攻击】造成240%的真实伤害。",
    "补充":"【总攻击】：连续行动多次后，在敌方目标回合开始时触发总攻击，基于触发前羁绊内队员累计的追击伤害造成一定比例的真实伤害，随后清空累计值。"
  },
  "击破": {
    "介绍":"【击破】队员的前/后台强度提高，并在攻击处于弱点击破状态的敌方目标后造成超击破伤害。\n敌方目标的初始韧性和韧性恢复量降低。",
    2:"20%前/后台强度。120%超击破伤害，10%初始韧性和韧性恢复量降低。",
    4:"60%前/后台强度。180%超击破伤害，20%初始韧性和韧性恢复量降低。击破敌人会充能【冲击波】。",
    6:"120%前/后台强度。240%超击破伤害，30%初始韧性和韧性恢复量降低。【冲击波】触发时，我方小队恢复等同于能量上限20%的能量。",
    8:"200%前/后台强度。360%超击破伤害，40%初始韧性和韧性恢复量降低。",
    10:"320%前/后台强度。500%超击破伤害，99%初始韧性和韧性恢复量降低。",
    "补充":"【冲击波】：普通/精英/首领敌人被击破时，获得1/3/6点充能，累计获得12点充能后，消耗12点充能发动【冲击波】，击破敌方全体目标并触发随机弱点击破效果，使其受到的伤害提高50%，并对敌方全体造成等同于600%/1200%/1800%/3,000%基础伤害的真实伤害。"
  },
  "量子同频": {
    "介绍":"敌人受到的伤害提高。【量子同频】角色获得可强化技能效果的【同频】。",
    2:"获得1层【同频】敌方目标受到的伤害提高15%。",
    3:"获得2层【同频】，敌方目标受到的伤害提高30%。",
    4:"获得3层【同频】，敌方目标受到的伤害提高60%。",
    5:"获得4层【同频】，敌方目标受到的伤害提高100%。",
    "补充":"【同频】：每层都会强化【量子同频】角色的技能。"
  },
  "减益": {
    "介绍":"【减益】队员的前/后台强度提高，行动时使敌方陷入负面效果时，为随机目标附加【离火】，使其造成的伤害降低，并且被攻击后受到额外真实伤害，单次行动内最多触发2次。",
    2:"20%前/后台强度。每层造成的伤害降低3%，10%真实伤害，【离火】上限3层。",
    4:"60%前/后台强度。每层造成的伤害降低4%，20%真实伤害。",
    6:"120%前/后台强度。每层造成的伤害降低5%，30%真实伤害，【离火】上限提高到5层。",
    8:"250%前/后台强度。每层造成的伤害降低6%，50%真实伤害。",
    "补充":"【离火】：目标造成的伤害降低，并且受到攻击后，根据层数额外受到基于原伤害的真实伤害。【离火】在目标被消灭时转移。"
  },
  "战技点":{
    "介绍":"我方战技点上限提高，我方小队施放战技或普攻时获得伤害增幅，【战技点】队员获得双倍加成，持续到行动结束。【战技点】队员消耗战技点时，每个战技点进行1次抽奖，奖池效果可叠加。",
    2:"12%速度增幅。获得12%伤害增幅，战技点上限提高2，可抽到小奖。",
    4:"24%速度增幅。获得24%伤害增幅，战技点上限提高3，可抽到中奖和大奖。",
    6:"40%速度增幅。获得48%伤害增幅，战技点上限提高4，抽奖时有概率额外获得1次特别奖，奖池中容易抽到更好的奖励。",
    8:"80%速度增幅。获得80%伤害增幅，战技点上限提高5，抽奖时有更高概率额外获得1次特别奖，抽到更好奖励的概率大幅提高。",
    "补充":"【谢谢惠顾】伤害增幅提高2%，持续至自身回合结束。\n【小奖】恢复1个战技点。\n【中奖】伤害增幅提高6%，持续至自身回合结束。\n【大奖】获得一个额外回合，并恢复4个战技点。\n【特别奖】获得1个金币！！！"
  },
  "能量":{
    "介绍":"【能量】队员的终结技伤害增幅提高。在场上生成【能量地块】，可提供终结技伤害增幅和能量恢复。",
    3:"12%终结技伤害增幅。",
    5:"24%终结技伤害增幅。【能量】角色施放终结技时，记录消耗的能量值。累计500点后，消耗500点，并对敌方全体目标造成800%基础伤害的物理属性伤害。",
    7:"60%终结技伤害增幅。累计值造成的伤害倍率提高至1,800%。",
    10:"200%终结技伤害增幅。备战区的所有地格变为【能量地块】，累计值造成的伤害倍率提高至10,000%。",
    "补充":"【能量地块】：进入战斗时，此地格上的角色获得20%终结技伤害增幅，【能量】角色获得双倍。任一【能量】角色施放终结技后，此地格上的角色固定恢复3%能量。"
  },
  "治疗": {
    "介绍":"我方小队的生命增幅提高12%。【治疗】队员的治疗强度提高。",
    2:"20%治疗强度。",
    4:"40%治疗强度。",
    6:"60%治疗强度，我方小队获得60%伤害增幅。"
  },
  "欢愉":{
    "介绍":"【欢愉】队员的幸运一击率提高。备战阶段召唤【阿哈】为小队提供增益，【阿哈】拥有初始属性并穿戴3件随机简易装备，可将物品栏中简易装备拖拽给阿哈，与阿哈装备栏中的简易装备依次合成对应进阶装备。合成进阶装备后，本局该栏位将会被固定，无法合成其它进阶装备。",
    3:"8%幸运一击率。",
    4:"16%幸运一击率。阿哈升至2星，解锁第2个装备栏。",
    5:"24%幸运一击率。阿哈升至3星，解锁第3个装备栏。",
    7:"40%幸运一击率。阿哈升至4星！阿哈的所有装备变成特权装备！",
    "补充":"【阿哈】在阿哈时刻期间始终视为攻击者（因此可触发相应进阶装备效果），并向小队分享自己的攻击类属性。"
  },
  "头号玩家":{
    "介绍":"在每个费用首次达到2星时，【银狼LV.999】可以选择变为更高费用的1星【银狼LV.999】，或者获得一件不占用装备栏的【骇客改件】。"
  },
  "大守护者":{
    "介绍":"布洛妮娅会基于小队中【贝洛伯格】和【燃血】角色的数量，加入人数更多的羁绊并获得相应技能。\n我方前台行动后布洛妮娅获得1点充能，充能满后布洛妮娅召唤可可利亚攻击敌方全体。"
  },
  "命运卜者":{
    "介绍":"黑天鹅每累计参与2场战斗后可以打开占卜屋，并选择1张启示卡以获得对应强化。"
  },
  "挚爱之人":{
    "介绍":"昔涟参与1场战斗后，昔涟的诗篇将在商店中刷新，并在被购买后提供各种强力增益。"
  },
  "魔术师":{
    "介绍":"Archer攻击后获得1点充能，充能满6点后，消耗6点充能立即进行投影，使我方小队中3名随机角色获得1件与其匹配的临时装备，临时装备在战斗结束后消失。"
  },
  "救世主":{
    "介绍":"白厄和卡厄斯兰那获得所有前台角色已激活的非独立羁绊效果，该效果不会影响羁绊效果激活的人数。"
  },
  "公司":{
    "介绍":"【公司】队员的后台强度和护盾强度提高。",
    2:"30%后台强度，10%护盾强度。普通战斗和遭遇节点开始时，获得1金币。",
    3:"100%后台强度，25%护盾强度。普通战斗和遭遇节点开始时，获得3金币。"
  },
  "盛会之星":{
    "介绍":"选择1名【盛会之星】角色作为【巨星】，使我方小队获得独特加成。",
    2:"获得选定【巨星】的加成。",
    3:"加成提高。",
    4:"加成提高。",
    5:"加成提高。",
    6:"加成提高。",
    "补充":{
      "大丽花":{
        "介绍":"击破伤害增幅提高，速度增幅提高。",
        2:"12%击破伤害增幅，4%速度增幅",
        3:"24%击破伤害增幅，8%速度增幅。",
        4:"36%击破伤害增幅，12%速度增幅。",
        5:"48%击破伤害增幅，16%速度增幅。",
        6:"66%击破伤害增幅，22%速度增幅。"
      },
      "加拉赫":{
        "介绍":"击破伤害增幅提高，治疗强度提高。",
        2:"12%击破伤害增幅，4%治疗强度。",
        3:"24%击破伤害增幅，8%治疗强度。",
        4:"36%击破伤害增幅，12%治疗强度。",
        5:"48%击破伤害增幅，16%治疗强度。",
        6:"66%击破伤害增幅，22%治疗强度。"
      },
      "花火":{
        "介绍":"进入战斗时获得战技点，普攻/战技伤害增幅提高。",
        2:"12%普攻伤害增幅，1个战技点。",
        3:"24%普攻伤害增幅，2个战技点。",
        4:"36%普攻伤害增幅，3个战技点。",
        5:"48%普攻伤害增幅，4个战技点。",
        6:"66%普攻伤害增幅，5个战技点。"
      },
      "星期日":{
        "介绍":"前台第一位角色前台强度提高，后台第一位角色后台强度提高。",
        2:"24%前台强度，24%后台强度。",
        3:"48%前台强度，48%后台强度。",
        4:"72%前台强度，72%后台强度。",
        5:"96%前台强度，96%后台强度。",
        6:"132%前台强度，132%后台强度。"
      },
      "知更鸟":{
        "介绍":"幸运一击率提高。",
        2:"10%幸运一击率。",
        3:"20%幸运一击率。",
        4:"30%幸运一击率。",
        5:"40%幸运一击率。",
        6:"55%幸运一击率。"
      },
      "黑天鹅":{
        "介绍":"我方小队中每有1个5费角色，则伤害增幅提高，可叠加。",
        2:"每个5费角色提高5%伤害增幅。",
        3:"每个5费角色提高10%伤害增幅。",
        4:"每个5费角色提高15%伤害增幅。",
        5:"每个5费角色提高20%伤害增幅。",
        6:"每个5费角色提高28%伤害增幅。"
      },
      "星徽":{
        "介绍":"我方小队每装备了1个星徽，则前/后台强度提高，可叠加。",
        2:"每个星徽使我方小队的前/后台强度提高8%。",
        3:"每个星徽使前/后台强度提高16%。",
        4:"每个星徽使前/后台强度提高24%。",
        5:"每个星徽使前/后台强度提高32%。",
        6:"每个星徽使前/后台强度提高44%。"
      }
    }
  },
  "星间旅人":{
    "介绍":"【星间旅人】角色会为你的小队提高特定属性，该效果会随着场上【星间旅人】角色数量而提升。\n【星间旅人】队员获得三倍收益。",
    1:"100%加成。",
    2:"120%加成。",
    3:"145%加成。",
    4:"175%加成。",
    5:"210%加成。",
    6:"250%加成。",
    7:"300%加成。",
    "补充":{
      "桑博":"伤害减免提高10%。",
      "银枝":"前台强度提高20%。",
      "真理医生":"速度增幅提高10%。",
      "绯英":"初始能量提高15。",
      "Saber":"伤害增幅提高10%。",
      "罗刹":"后台强度提高20%。",
      "Archer":"幸运一击率提高10%。",
      "星徽":"幸运一击伤害提高18%。",
      "火花":"提供随机属性加成。每节点变化！"
    }
  },
  "狼狩":{
    "介绍":"召唤【步离人】协同战斗，其在参与战斗后可以获得经验并升级。我方队员携带更多装备参与战斗会使其额外获得经验。\n【狼狩】队员的前/后台强度提高，【步离人】每次升级后使该加成提高50%。",
    3:"15%前/后台强度",
    5:"30%前/后台强度。2倍经验。",
    6:"50%前/后台强度。3倍经验。",
    8:"90%前/后台强度。6倍经验。",
    "补充":"【步离人】：参与战斗后获得4点经验，我方队员每携带1件简易装备，就会在战斗后额外使其获得1点经验，获得足够的经验后【步离人】会升级，造成更多伤害并提供增益。进阶装备和特权装备算作2件简易装备。" 
  },
  "巡海游侠":{
    "介绍":"【巡海游侠】队员获得伤害增幅和速度增幅。若将【巡海游侠】放置于后台，则位于后台的【巡海游侠】的星级会使前台【巡海游侠】额外获得伤害增幅和速度增幅。",
    1:"8%伤害增幅，8%速度增幅。",
    2:"16%伤害增幅，16%速度增幅。",
    3:"28%伤害增幅，28%速度增幅。",
    4:"30%0%速度增幅0%速度增幅。【巡海游侠】队员进入战斗时行动提前100%。",
    "补充":"1/2/3/4星的后台【巡海游侠】，提供1/3/6/12倍伤害增幅和速度增幅。"
   },
  "列车同行":{
    "介绍":"召唤【星穹列车】撞击敌方全体目标，并在场上留下【光轨】，使我方小队的前/后台强度提高。",
    2:"战斗开始时撞击并提供1层【光轨】，使我方小队前/后台强度提高20%",
    4:"列车额外以300速度撞击，每层【光轨】提供的提高至40%，最多叠加2层。【星穹列车】队员获得双倍收益。",
    6:"每层【光轨】提供的前/后台强度提高至60%，可叠加上限提高至3层，每层额外使敌方全体目标防御力降低10%"    
  },
  "昼之半神":{
    "介绍":"获得仅供【昼之半神】角色穿戴的白昼装备。n【昼之半神】队员的前/后台强度和速度增幅提高。",
    3:"10%前/后台强度，5%速度增幅。获得【白昼·光速螺旋桨】。",
    4:"18%前/后台强度，9%速度增幅。获得【白昼·武器大师】。",
    6:"36%前/后台强度，18%速度增幅。获得【白昼·斩首行动】。",
    9:"60%前/后台强度，30%速度增幅。白昼装备的特殊效果获得增强。进入战斗时，为你的【昼之半神】角色们穿戴满强化后的白昼装备！"
  },
  "夜之半神":{
    "介绍":"每个战斗阶段后生成【月光精华】，完胜后获得2倍【月光精华】。获得足够的【月光精华】后可以获取晶矿奖励。\n【夜之半神】队员的前/后台强度提高。",
    2:"20%前/后台强度。2个【月光精华】。",
    4:"50%前/后台强度。5个【月光精华】。",
    7:"100%前/后台强度。9个【月光精华】。",
    9:"1200%前/后台强度。30个【月光精华】。",
    "补充":"【晶矿】开启后可能获取金币、角色、装备或其它稀有物品！"
  },
  "星核猎手":{
    "介绍":"装备最多的【星核猎手】成为【猎星人】，【星核猎手】会协助【猎星人】作战。\n【星核猎手】的伤害增幅和生命增幅提高。",
    2:"24%伤害增幅，12%生命增幅。",
    3:"48%伤害增幅，24%生命增幅。",
    4:"80%伤害增幅，36%生命增幅。额外激活一位【猎星人】",
    "补充":{
      "刃":"【星核猎手】每攻击4次，刃立即施放强化普攻攻击生命值最高的敌人。战斗开始时已记录2次攻击。",
      "卡芙卡":"【星核猎手】每攻击4次，卡芙卡立即施放战技攻击敌人。战斗开始时已记录2次攻击。",
      "银狼":"【星核猎手】每攻击5次，银狼立即施放战技攻击敌人。战斗开始时已记录3次攻击。",
      "流萤":"【星核猎手】每攻击6次，流萤立即施放终结技攻击敌人。战斗开始时已记录3次攻击。",
      "银狼LV.999":"【星核猎手】每攻击7次，银狼LV.999立即施放1次固定计入40笑点的欢愉技。战斗开始时已记录4次攻击。",
      "补充":"仅激活角色赋能的【星核猎手】可成为【猎星人】。"
    }
  },
  "仙舟":{
    "介绍":"【仙舟】召唤【神君】，其行动时将攻击敌方全体目标。【仙舟】队员行动后为【神君】叠加攻击段数并使其行动提前。【仙舟】队员的前/后台强度和速度增幅提高。",
    3:"20%前/后台强度，8%速度增幅。",
    5:"40%前/后台强度，16%速度。【神君】基础伤害段数增加至6。",
    7:"80%前/后台强度，32%速度。【仙舟】队员行动后叠加的伤害段数提高至2，战斗开始时【神君】立即行动。",
    10:"200%前/后台强度，60%速度。【神君】基础伤害段数增加至10，每段倍率提高至600%，并更频繁的发动攻击！",
    "补充":"【神君】：以150速度行动，行动时对敌方全体目标造成300%/600%/900%/1,200%基础伤害的雷属性伤害，并对随机敌方目标造成多段伤害。【仙舟】队员行动后为神君增加攻击段数，并使神君行动提前10%/10%/10%/25%。"
  },
  "贝洛伯格":{
    "介绍":"【贝洛伯格】队员行动后为【造物引擎】充能，【造物引擎】的能量充满后立即攻击敌方目标，并让本场战斗中造成伤害最多的【贝洛伯格】角色立即行动。【贝洛伯格】队员和【造物引擎】的伤害增幅提高。",
    2:"18%伤害增幅。",
    4:"36%伤害增幅。【造物引擎】额外造成【贝洛伯格】队员已造成总伤害的25%伤害，攻击后清零。",
    6:"72%伤害增幅。额外伤害的转化比例提高至40%。",
    "补充":"【造物引擎】：【贝洛伯格】队员行动后充能1点，上限12点，能量充满时消耗12点对敌方全体目标造成400%/800%/1200%基础伤害的火属性伤害，并使战斗中造成伤害最多的【贝洛伯格】角色立即行动。初始拥有8点能量。"
  },
  "银河学者":{
    "介绍":"战斗开始时，基于【银河学者】角色的星级叠加【猫猫糕】，并在战斗后根据层数获得额外奖励。\n每星级【银河学者】提供的【DNA】进度为2/4/8/20。",
    2:"30%前/后台强度。",
    4:"80%前/后台强度。获得1.5倍【DNA】。",
    6:"200%前/后台强度。获得2倍【DNA】。",
    "补充":"【猫猫糕】：【银河学者】队员的前/后台强度提高，并在我方前台回合开始时为其回复等同于其最大生命值20%的生命，每层【猫猫糕】使该倍率提高5%。我方前台伤害减免提高12%，每层【猫猫糕】使该倍率提高2%。"
  }
}