window.__CHR_EXPERTS = ["银狼","加拉赫","青雀","貊泽","停云"];

window.__CHR_SPEND = {
  "1":["爻光","大丽花","桑博","加拉赫","青雀","翡翠","停云","三月七","乱破","藿藿","刃","艾丝妲","阿格莱雅","飞霄","椒丘","黑塔","赛飞儿","貊泽"],
  "2":["绯英","不死途","卡芙卡","风堇","阮梅","佩拉","丹恒腾荒","灵砂","砂金","丹恒饮月","花火","缇宝","万敌","银枝"],
  "3":["星期日","娜塔莎","那刻夏","镜流","白厄","忘归人","姬子","刻律德菈","真理医生","Saber","黄泉","希儿"],
  "4":["欢愉主","记忆主","火花","遐蝶","彦卿","海瑟音","银狼","知更鸟","杰帕德","波提欧","罗刹","长夜月","大黑塔","符玄"],
  "5":["云璃","托帕","黑天鹅","流萤","昔涟","瓦尔特","布洛妮娅","景元","Archer"],
  "special":["狼尊"]
};

window.__CHR_POSITION = {
    "前台":["狼尊","火花","昔涟","瓦尔特","布洛妮娅","景元","Archer","流萤","杰帕德","波提欧","大黑塔","遐蝶","海瑟音","记忆主","真理医生","黄泉","希儿","星期日","白厄","风堇","灵砂","砂金","丹恒饮月","乱破","艾丝妲","阿格莱雅","飞霄","椒丘","赛飞儿","青雀"],
    "后台":["欢愉主","云璃","托帕","黑天鹅","罗刹","符玄","彦卿","知更鸟","忘归人","姬子","那刻夏","镜流","花火","阮梅","佩拉","丹恒腾荒","刃","貊泽","翡翠","停云","三月七"],
    "前后台":["不死途","绯英","爻光","大丽花","长夜月","银狼","刻律德菈","Saber","娜塔莎","缇宝","万敌","银枝","卡芙卡","藿藿","黑塔","桑博","加拉赫"]
};