window.__FIX_DATA = {
    "4.3":[
        "修复了「货币战争」中，角色「银狼LV.999（欢愉•虚数）」天赋的技能图标显示有误的问题。",
        "修复了「货币战争」中，特定情况下角色「火花（欢愉•火）」欢愉技的当前【流量】计数显示有误的问题。该修复不影响实际效果。",
        "修复了「货币战争」中，特定情况下角色「昔涟（记忆•冰）」的天赋效果多波次异常生效的问题。",
        "修复了「货币战争」-「超频博弈」中，特定情况下，专家顾问角色「银狼（虚无•量子）」的解锁条件文本有误的问题。",
        "修复了「货币战争」中，部分角色穿戴装备【欢愉星徽】时，特定情况下战斗中部分界面显示异常的问题。",
        "修复了「货币战争」中，部分角色穿戴装备【欢愉星徽】时，特定情况下欢愉技【极乐漩涡】异常消耗战技点的问题。",
        "修复了「货币战争」中，角色同时装备光锥「愿虹光永驻天空（记忆）」且穿戴装备【欢愉星徽】时，光锥技能的部分效果生效异常的问题。修复后光锥技能实际效果与技能描述保持一致。",
        "修复了「货币战争」中，部分改变角色星级的投资策略对阵营羁绊「巡海游侠」提供的星级加成生效异常的问题。",
        "修复了「货币战争」中，角色「不死途（巡猎•雷）」位于后台时，特定情况下阵营羁绊「巡海游侠」提供的羁绊增益计入星级异常的问题。",
        "修复了「货币战争」中，激活流派羁绊「欢愉」后，【阿哈】的装备导致投资策略【空仓】【空仓+】生效异常的问题。",
        "修复了「货币战争」中，激活流派羁绊「欢愉」后，特定情况下【阿哈】的部分属性显示有误的问题。",
        "修复了「货币战争」中，激活独立羁绊「挚爱之人」后，特定情况下昔涟的诗篇异常刷新的问题。",
        "修复了「货币战争」中，激活独立羁绊「魔术师」后，获得的特定临时装备效果异常的问题。",
        "修复了「货币战争」中，特定情况下，备战阶段的场上角色计数显示异常的问题。",
        "修复了「货币战争」中，特定情况下，【羁绊图鉴】中「星间旅人」的部分羁绊效果文本有误的问题。",
        "修复了「货币战争」中，特定情况下，敌方「黑潮参议」的部分战斗表现异常的问题。"
    ],
    
    "4.1":[
        "修复了「货币战争」中，当角色「爻光（欢愉•物理）」处于后台时，行动序列中阿哈时刻的部分UI显示异常的问题。",
        "修复了「货币战争」中，角色「阮•梅（同谐•冰）」处于后台且使用时装「雪绽梅笺」的情况下，施放战技时部分UI显示异常的问题。",
        "修复了「货币战争」中，角色「银狼（虚无•量子）」的前台战技部分效果描述有误的问题。修复后描述与实际效果保持一致。",
        "修复了使用手柄体验游戏时，「货币战争」中，部分界面的按键提示信息异常的问题。"
    ],

    "3.8":[
        "修复了「持续伤害」的伤害类型能错误触发「幸运一击」的问题。",
        "修复了角色在前台时，装备属性【初始能量】在战斗中不生效的问题。",
        "修复了战斗开始时【星穹列车】撞击敌人后，特定情况下角色「翡翠」无法正确指定【收债人】的问题。",
        "修复了角色「风堇」达到4星时，没有正确受到昔涟的【黄金铸成的史诗】增益的问题。",
        "修复了角色「停云」在后台时会给前台忆灵充能的问题。",
        "修复了角色「飞霄」1星时，每场战斗中可永久提高追击伤害的层数上限错误的问题。",
        "修复了角色「云璃」为我方角色格挡伤害后，在特定情况下会使该角色后续受到的伤害异常降低的问题。",
        "修复了角色「长夜月」在后台时，【至暗之谜】提供的易伤效果会在首领敌人进入下一阶段时被异常清除的问题。",
        "修复了角色「花火」在后台施放终结技后，暴击伤害提高效果持续时间未被正常刷新的问题。",
        "修复了角色「银狼」的【致命缺陷】在特定情况下会被异常解除的问题。",
        "修复了角色「符玄」在后台时，异常为我方忆灵回复生命的问题。",
        "修复了角色「符玄」在前台，及「罗刹」在前/后台装备「绝对热量」时，在特定情况下无法正确行动的问题。",
        "修复了角色「万敌」在前台时，【弑神登神】未能正确削减敌方韧性的问题。",
        "修复了特定情况下，角色「景元」的【神君】段数累积异常的问题。",
        "修复了在首领「星核猎手」卡芙卡的战斗中，部分角色及忆灵被【支配】后随机攻击我方目标时伤害异常偏高的问题。",
        "修复了词缀【永久创伤】在特定情况下会使角色生命上限异常降低为1的问题。",
        "修复了词缀【同步行动】在特定情况下会使角色获得的行动提前效果生效异常的问题。",
        "修复了特定情况下，角色「长夜月」的忆灵可错误触发投资策略【鲜血阶梯】及装备【杀红眼】的伤害增幅效果的问题，及错误触发投资策略【战术义眼+/++】的恢复能量的问题。",
        "修复了特定情况导致异常触发角色「飞霄」的额外追击的问题。",
        "修复了特定情况下，角色穿戴装备【光能盾牌】时，我方目标速度变化导致的行动值异常问题。",
        "调整了「货币战争•零和博弈」中，部分平板设备的角色出售区域范围。",
        "调整了「货币战争•零和博弈」中，【昔涟的诗篇】的部分UI表现。",
        "修复了「货币战争•零和博弈」中，特定情况下角色属性详情内速度增幅显示有误的问题。该修复不影响角色实际速度。",
        "修复了「货币战争•零和博弈」中，特定情况下角色属性详情内速度增幅显示有误的问题。该修复不影响角色实际速度。",
        "修复了「货币战争•零和博弈」中，流派羁绊「能量」的部分效果文本有误的问题。该修复不影响实际效果。",
        "修复了「货币战争•零和博弈」中，特定情况下，流派羁绊「量子同频」的部分羁绊基础效果被异常解除的问题。",
        "修复了「货币战争•零和博弈」中，激活阵营羁绊「狼狩」后，特定情况下备战阶段【步离人】获得的经验值显示异常的问题。",
        "修复了「货币战争•零和博弈」中，阵营羁绊「列车同行」羁绊分级效果中部分文本描述有误的问题。该修复不影响实际效果。",
        "修复了「货币战争•零和博弈」中，特定情况下，角色「刃（毁灭•风）」角色赋能中部分效果异常的问题。修复后效果与角色赋能描述保持一致。",
        "修复了「货币战争•零和博弈」中，当角色「符玄（存护•量子）」处于后台时，特定情况下使我方角色受到的伤害异常的问题。",
        "修复了「货币战争•零和博弈」中，特定情况下，角色「翡翠（智识•量子）」角色赋能中部分效果异常的问题。修复后效果与角色赋能描述保持一致。",
        "修复了「货币战争•零和博弈」中，特定情况下，角色「托帕&账账（巡猎•火）」角色赋能中部分效果异常的问题。",
        "修复了「货币战争•零和博弈」中，当角色「万敌（毁灭•虚数）」升至4星时，部分角色赋能文本描述有误的问题。该修复不影响实际效果。",
        "修复了「货币战争•零和博弈」中，特定情况下，忆灵「迷迷」的忆灵天赋效果异常未生效的问题。",
        "修复了「货币战争•零和博弈」中，投资策略【读博深造】效果描述有误的问题。该修复不影响实际效果。",
        "修复了「货币战争•零和博弈」中，持有投资策略【决议：娱乐星球】时，特定情况下「优势布局」-「势力削弱」未生效的问题。",
        "修复了「货币战争•零和博弈」中，特定情况下，投资环境【经济过热】【经济严重过热】的效果异常的问题。",
        "修复了「货币战争•零和博弈」中，持有投资策略【多元化团队】时，对局记录中羁绊信息显示有误的问题。",
        "修复了「货币战争•零和博弈」中，当敌人持有词缀【净化身心】时，特定情况下会多次恢复生命值的问题。",
        "修复了「货币战争•零和博弈」中，当敌人持有词缀【冷冻冬眠】时，特定情况下敌方「可可利亚」异常多次施放【碎冰震荡】的问题。",
        "修复了「货币战争•零和博弈」中，特定情况下敌方目标数量及位置异常的问题。",
        "修复了「货币战争•零和博弈」中，特定情况下，备战阶段界面有概率显示异常的问题。",
        "修复了「货币战争•零和博弈」中，特定情况下，战技点UI表现异常的问题。",
        "修复了「货币战争•零和博弈」中，「预期收益」-「巅峰对弈」中部分目标描述有误的问题。",
        "修复了「货币战争•零和博弈」中，「优势布局」-「赛季优势」中部分节点描述有误的问题。",
    ]
};

window.__UPGRADE_DATA = {
    "4.2":{
        "info":[
            "「货币战争•零和博弈」赛季扩充说明",
            "新员工加入，新增全新流派羁绊「欢愉」，扩充了晋升等级上限和奖励，以及新增了大量投资环境、投资策略、竞争对手阵营等内容！详情可关注官方公告【「货币战争•零和博弈」赛季扩充说明 V4.2】。",
            "本期新增员工：「不死途」「银狼LV.999」「绯英」，「开拓者」解锁欢愉命途"
        ],
        "herf":"https://www.miyoushe.com/sr/article/74751748"
    },

    "4.0":{
        "info":[
            "「货币战争•零和博弈」赛季扩充说明",
            "新员工加入，晋升等级上限及奖励扩充，新增【专家顾问】机制及部分其他内容，调整了大量羁绊和角色等。详情可关注官方公告【「货币战争•零和博弈」赛季扩充说明 V4.0】。",
            "本期新增员工：「大丽花」「爻光」「火花」"
        ],
        "herf":"https://www.miyoushe.com/sr/article/73128301"
    },

    "3.8":{
        "info":[
            "「货币战争•零和博弈」调整说明",
            "「货币战争•零和博弈」特别更新，加强了大量角色、羁绊、装备、投资策略等内容，使它们可以在高难度对局中有更好的表现，并修复了一些异常问题。详情可关注官方公告【「货币战争•零和博弈」调整说明 V3.8】。"
        ],
        "herf":"https://www.miyoushe.com/sr/article/71454150"
    },

    "3.7":{
        "info":"「货币战争•零和博弈」：体验全新大型常驻玩法，可获取变量骰子、自塑尘脂等奖励。",
        "herf":"https://www.miyoushe.com/sr/article/70242029"
    },

};

window.__UPDATE_DATA = {
    "4.2":{
        "info":"4.2版本开始，「货币战争」积分与「模拟宇宙」积分合并，且调整了部分积分线奖励内容。首期新周期积分持续5日，次周周一恢复每周更替。",
        "herf":"https://www.miyoushe.com/sr/article/74451245"
    }
};