window.__FIX_DATA = {
    "4.3":[
        "修复了「货币战争」中，角色「银狼LV.999（欢愉•虚数）」天赋的技能图标显示有误的问题。",
        "修复了「货币战争」中，特定情况下角色「火花（欢愉•火）」欢愉技的当前【流量】计数显示有误的问题。该修复不影响实际效果。",
        "修复了「货币战争」中，特定情况下角色「昔涟（记忆•冰）」的天赋效果多波次异常生效的问题。",
        "修复了「货币战争」-「超频博弈」中，特定情况下，专家顾问角色「银狼（虚无•量子）」的解锁条件文本有误的问题。",
        "修复了「货币战争」中，部分角色穿戴装备【欢愉星徽】时，特定情况下战斗中部分界面显示异常的问题。",
        "修复了「货币战争」中，部分角色穿戴装备【欢愉星徽】时，特定情况下欢愉技【极乐漩涡】异常消耗战技点的问题。",
        "修复了「货币战争」中，角色同时装备光锥「愿虹光永驻天空（记忆）」且穿戴装备【欢愉星徽】时，光锥技能的部分效果生效异常的问题。修复后光锥技能实际效果与技能描述保持一致。",
        "修复了「货币战争」中，部分改变角色星级的投资策略对阵营羁绊「巡海游侠」提供的星级加成生效异常的问题。",
        "修复了「货币战争」中，角色「不死途（巡猎•雷）」位于后台时，特定情况下阵营羁绊「巡海游侠」提供的羁绊增益计入星级异常的问题。",
        "修复了「货币战争」中，激活流派羁绊「欢愉」后，【阿哈】的装备导致投资策略【空仓】【空仓+】生效异常的问题。",
        "修复了「货币战争」中，激活流派羁绊「欢愉」后，特定情况下【阿哈】的部分属性显示有误的问题。",
        "修复了「货币战争」中，激活独立羁绊「挚爱之人」后，特定情况下昔涟的诗篇异常刷新的问题。",
        "修复了「货币战争」中，激活独立羁绊「魔术师」后，获得的特定临时装备效果异常的问题。",
        "修复了「货币战争」中，特定情况下，备战阶段的场上角色计数显示异常的问题。",
        "修复了「货币战争」中，特定情况下，【羁绊图鉴】中「星间旅人」的部分羁绊效果文本有误的问题。",
        "修复了「货币战争」中，特定情况下，敌方「黑潮参议」的部分战斗表现异常的问题。"
    ],
    
    "4.1":[
        "修复了「货币战争」中，当角色「爻光（欢愉•物理）」处于后台时，行动序列中阿哈时刻的部分UI显示异常的问题。",
        "修复了「货币战争」中，角色「阮•梅（同谐•冰）」处于后台且使用时装「雪绽梅笺」的情况下，施放战技时部分UI显示异常的问题。",
        "修复了「货币战争」中，角色「银狼（虚无•量子）」的前台战技部分效果描述有误的问题。修复后描述与实际效果保持一致。",
        "修复了使用手柄体验游戏时，「货币战争」中，部分界面的按键提示信息异常的问题。"
    ],


};

window.__UPGRADE_DATA = {
    "4.2":{
        "info":[
            "「货币战争•零和博弈」赛季扩充说明",
            "新员工加入，新增全新流派羁绊「欢愉」，扩充了晋升等级上限和奖励，以及新增了大量投资环境、投资策略、竞争对手阵营等内容！详情可关注官方公告【「货币战争•零和博弈」赛季扩充说明 V4.2】。",
            "本期新增员工：「不死途」「银狼LV.999」「绯英」，「开拓者」解锁欢愉命途"
        ],
        "herf":"https://www.miyoushe.com/sr/article/74751748"
    },

    "4.0":{
        "info":[
            "「货币战争•零和博弈」赛季扩充说明",
            "新员工加入，晋升等级上限及奖励扩充，新增【专家顾问】机制及部分其他内容，调整了大量羁绊和角色等。详情可关注官方公告【「货币战争•零和博弈」赛季扩充说明 V4.0】。",
            "本期新增员工：「大丽花」「爻光」「火花」"
        ],
        "herf":"https://www.miyoushe.com/sr/article/73128301"
    },

    "3.8":{
        "info":[
            "「货币战争•零和博弈」调整说明",
            "「货币战争•零和博弈」特别更新，加强了大量角色、羁绊、装备、投资策略等内容，使它们可以在高难度对局中有更好的表现，并修复了一些异常问题。详情可关注官方公告【「货币战争•零和博弈」调整说明 V3.8】。"
        ],
        "herf":"https://www.miyoushe.com/sr/article/71454150"
    },

    "3.7":{
        "info":"「货币战争•零和博弈」：体验全新大型常驻玩法，可获取变量骰子、自塑尘脂等奖励。",
        "herf":"https://www.miyoushe.com/sr/article/70242029"
    },

};

window.__UPDATE_DATA = {
    "4.2":{
        "info":"4.2版本开始，「货币战争」积分与「模拟宇宙」积分合并，且调整了部分积分线奖励内容。首期新周期积分持续5日，次周周一恢复每周更替。",
        "herf":"https://www.miyoushe.com/sr/article/74451245"
    }
};